app/controllers/isup_controller.rb

INSERT INTO "requests" ("timestamp", "url", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["timestamp", "01/07/2016 23:49"], ["url", "http://google.com"], ["status", "Available"], ["created_at", "2016-07-02 03:49:49.561498"], ["updated_at", "2016-07-02 03:49:49.561498"]]
---
  def validate
    @url_string = params[:url]

    if !is_valid_url?(@url_string)
      @status = "URL Format Issue"
    else
      if url_exist?(@url_string)
        @status = "Available"
      else
        @status = "Not Available"
      end
    end

    require 'date'
    current_time = DateTime.now

    request = Request.new
    request.timestamp = current_time.strftime "%d/%m/%Y %H:%M"
    request.url = @url_string
    request.status = @status

    request.save