app/controllers/requests_controller.rb

  def index
    @requests = Request.all
---
SELECT "requests".* FROM "requests"

  def destroy
    @request.destroy
---
DELETE FROM "requests" WHERE "requests"."id" = ?  [["id", 1]]

    def set_request
      @request = Request.find(params[:id])
---
SELECT  "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT 1  [["id", 1]]